In [2]:
import pandas as pd
import numpy as np

In [3]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [5]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

NaN values in Python

In [6]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

Any operation with NaN results into NaN only

In [7]:
5+np.nan

nan

In [8]:
0* np.nan

nan

In [9]:
np.nan * np.nan

nan

In [11]:
#They do not throw error in additon, subtraction etc. But result into nan, which is again not useful for us.

vals2.sum()

nan

In [14]:
vals2.mean()

nan

In [19]:
#NumPy does provide some special aggregations that will ignore these missing values:

np.nansum(vals2), np.nanmean(vals2)    #nan is a float value

(8.0, 2.6666666666666665)

### NaN and None in Pandas

Pandas treats both NaN and None interchangeably

In [20]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [21]:
#setting a value to NaN, automatically casts the value to floating point

##### Operating Null Values:
- isnull()  
> Generate a Boolean mask indicating missing values
- notnull()
> Opposite of isnull()
- dropna()
> Return a filtered version of the data
- fillna()
> Return a copy of the data with missing values filled or imputed

In [22]:
data = pd.Series([1, np.nan, 'hello', None])

In [24]:
data.isnull()  # check each element if nulll or not

0    False
1     True
2    False
3     True
dtype: bool

In [25]:
data.dropna()

0        1
2    hello
dtype: object

In [27]:
#null in dataframes
df = pd.DataFrame([[1, np.nan, 2], [2, 3, 5], [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [28]:
df.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [31]:
df.dropna()           #drops entire row with any null value

     0    1  2
1  2.0  3.0  5

In [37]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [38]:
df.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [39]:
df.dropna(how = 'all')       # drop a row only when all the values are null

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [43]:
df.dropna(how='all', axis='columns')          # drop the columns with all null values

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6